; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v12 ?v4)
             (pred_4 ?v3 ?v1)
             (pred_2 ?v12 ?v1)
             (pred_12 ?v13 ?v12 )
	     (pred_8 ?v12)
             (pred_1 ?v7)
             (pred_5 ?v3)
             (pred_11 ?v1)
             (pred_6 ?v12)
             (pred_3 ?v3)
             (pred_10 ?v12)
             (pred_9 ))



(:action op_1
:parameters (?v11 ?v10 ?v6 ?v5)
:precondition (and (pred_1 ?v11) (pred_1 ?v10) (pred_5 ?v6) (pred_11 ?v5)
          (pred_7 ?v11 ?v10) (pred_4 ?v6 ?v5)
                   (pred_2 ?v10 ?v5) (pred_8 ?v11) 
                   (pred_6 ?v10) (pred_3 ?v6))
:effect (and  (pred_10 ?v10) (not (pred_6 ?v10))))


(:action op_4
:parameters (?v11 ?v8)
:precondition (and (pred_1 ?v11) (pred_1 ?v8)
               (pred_8 ?v11) (pred_7 ?v11 ?v8) (pred_10 ?v8))
:effect (and (pred_8 ?v8) (not (pred_8 ?v11))))

(:action op_3
:parameters (?v11 ?v6)
:precondition (and (pred_1 ?v11) (pred_5 ?v6) 
                  (pred_8 ?v11) (pred_12 ?v6 ?v11) (pred_9 ))
:effect (and (pred_3 ?v6)
   (not (pred_12 ?v6 ?v11)) (not (pred_9 ))))


(:action op_5
:parameters (?v11 ?v2 ?v9)
:precondition (and (pred_1 ?v11) (pred_5 ?v2) (pred_5 ?v9)
                  (pred_8 ?v11) (pred_3 ?v9) (pred_12 ?v2 ?v11))
:effect (and (pred_3 ?v2) (pred_12 ?v9 ?v11)
        (not (pred_3 ?v9)) (not (pred_12 ?v2 ?v11))))

(:action op_2
:parameters (?v11 ?v6)
:precondition (and (pred_1 ?v11) (pred_5 ?v6) 
                  (pred_8 ?v11) (pred_3 ?v6))
:effect (and (pred_9 ) (pred_12 ?v6 ?v11) (not (pred_3 ?v6)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_23 obj_30 obj_25 obj_07 obj_14 obj_11 obj_20 obj_27 obj_21 obj_12 obj_31 obj_08 obj_04 obj_09 obj_28 obj_01 obj_26 obj_22 obj_24 obj_13 obj_05 obj_03 obj_29 obj_19 obj_18
    obj_06 obj_16 obj_10
    obj_15 obj_02 obj_17
    )

    (:init
       (pred_9)

       (pred_1 obj_23)
       (pred_1 obj_30)
       (pred_1 obj_25)
       (pred_1 obj_07)
       (pred_1 obj_14)
       (pred_1 obj_11)
       (pred_1 obj_20)
       (pred_1 obj_27)
       (pred_1 obj_21)
       (pred_1 obj_12)
       (pred_1 obj_31)
       (pred_1 obj_08)
       (pred_1 obj_04)
       (pred_1 obj_09)
       (pred_1 obj_28)
       (pred_1 obj_01)
       (pred_1 obj_26)
       (pred_1 obj_22)
       (pred_1 obj_24)
       (pred_1 obj_13)
       (pred_1 obj_05)
       (pred_1 obj_03)
       (pred_1 obj_29)
       (pred_1 obj_19)
       (pred_1 obj_18)
       (pred_11 obj_06)
       (pred_11 obj_16)
       (pred_11 obj_10)
       (pred_5 obj_15)
       (pred_5 obj_02)
       (pred_5 obj_17)

       (pred_7 obj_23 obj_11)
       (pred_7 obj_23 obj_30)
       (pred_7 obj_30 obj_20)
       (pred_7 obj_30 obj_25)
       (pred_7 obj_30 obj_23)
       (pred_7 obj_25 obj_27)
       (pred_7 obj_25 obj_07)
       (pred_7 obj_25 obj_30)
       (pred_7 obj_07 obj_21)
       (pred_7 obj_07 obj_14)
       (pred_7 obj_07 obj_25)
       (pred_7 obj_14 obj_12)
       (pred_7 obj_14 obj_07)
       (pred_7 obj_11 obj_31)
       (pred_7 obj_11 obj_20)
       (pred_7 obj_11 obj_23)
       (pred_7 obj_20 obj_08)
       (pred_7 obj_20 obj_27)
       (pred_7 obj_20 obj_30)
       (pred_7 obj_20 obj_11)
       (pred_7 obj_27 obj_04)
       (pred_7 obj_27 obj_21)
       (pred_7 obj_27 obj_25)
       (pred_7 obj_27 obj_20)
       (pred_7 obj_21 obj_09)
       (pred_7 obj_21 obj_12)
       (pred_7 obj_21 obj_07)
       (pred_7 obj_21 obj_27)
       (pred_7 obj_12 obj_28)
       (pred_7 obj_12 obj_14)
       (pred_7 obj_12 obj_21)
       (pred_7 obj_31 obj_01)
       (pred_7 obj_31 obj_08)
       (pred_7 obj_31 obj_11)
       (pred_7 obj_08 obj_26)
       (pred_7 obj_08 obj_04)
       (pred_7 obj_08 obj_20)
       (pred_7 obj_08 obj_31)
       (pred_7 obj_04 obj_22)
       (pred_7 obj_04 obj_09)
       (pred_7 obj_04 obj_27)
       (pred_7 obj_04 obj_08)
       (pred_7 obj_09 obj_24)
       (pred_7 obj_09 obj_28)
       (pred_7 obj_09 obj_21)
       (pred_7 obj_09 obj_04)
       (pred_7 obj_28 obj_13)
       (pred_7 obj_28 obj_12)
       (pred_7 obj_28 obj_09)
       (pred_7 obj_01 obj_05)
       (pred_7 obj_01 obj_26)
       (pred_7 obj_01 obj_31)
       (pred_7 obj_26 obj_03)
       (pred_7 obj_26 obj_22)
       (pred_7 obj_26 obj_08)
       (pred_7 obj_26 obj_01)
       (pred_7 obj_22 obj_29)
       (pred_7 obj_22 obj_24)
       (pred_7 obj_22 obj_04)
       (pred_7 obj_22 obj_26)
       (pred_7 obj_24 obj_19)
       (pred_7 obj_24 obj_13)
       (pred_7 obj_24 obj_09)
       (pred_7 obj_24 obj_22)
       (pred_7 obj_13 obj_18)
       (pred_7 obj_13 obj_28)
       (pred_7 obj_13 obj_24)
       (pred_7 obj_05 obj_03)
       (pred_7 obj_05 obj_01)
       (pred_7 obj_03 obj_29)
       (pred_7 obj_03 obj_26)
       (pred_7 obj_03 obj_05)
       (pred_7 obj_29 obj_19)
       (pred_7 obj_29 obj_22)
       (pred_7 obj_29 obj_03)
       (pred_7 obj_19 obj_18)
       (pred_7 obj_19 obj_24)
       (pred_7 obj_19 obj_29)
       (pred_7 obj_18 obj_13)
       (pred_7 obj_18 obj_19)
       (pred_6 obj_22)
       (pred_6 obj_04)
       (pred_6 obj_01)
       (pred_2  obj_22 obj_06)
       (pred_2  obj_04 obj_16)
       (pred_2  obj_01 obj_10)
       (pred_10 obj_23)
       (pred_10 obj_30)
       (pred_10 obj_25)
       (pred_10 obj_07)
       (pred_10 obj_14)
       (pred_10 obj_11)
       (pred_10 obj_20)
       (pred_10 obj_27)
       (pred_10 obj_21)
       (pred_10 obj_12)
       (pred_10 obj_31)
       (pred_10 obj_08)
       (pred_10 obj_09)
       (pred_10 obj_28)
       (pred_10 obj_26)
       (pred_10 obj_24)
       (pred_10 obj_13)
       (pred_10 obj_05)
       (pred_10 obj_03)
       (pred_10 obj_29)
       (pred_10 obj_19)
       (pred_10 obj_18)

       (pred_4  obj_15 obj_06)
       (pred_4  obj_02 obj_16)
       (pred_4  obj_17 obj_10)
       (pred_12 obj_15 obj_25)
       (pred_12 obj_02 obj_26)
       (pred_12 obj_17 obj_19)
       (pred_8 obj_30)
    )

    (:goal (and
       (pred_12 obj_15 obj_14)
       (pred_12 obj_02 obj_05)
    ))
(:constraints
  (always (not (pred_8 obj_07)))
)
)

; plan
1. (op_4 obj_30 obj_25)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_25)
   goals met: 0 of 2
2. (op_3 obj_25 obj_15)
   deleted: (pred_12 obj_15 obj_25) (pred_9)
   added: (pred_3 obj_15)
   goals met: 0 of 2
3. (op_4 obj_25 obj_30)
   deleted: (pred_8 obj_25)
   added: (pred_8 obj_30)
   goals met: 0 of 2
4. (op_4 obj_30 obj_20)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_20)
   goals met: 0 of 2
5. (op_4 obj_20 obj_08)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_08)
   goals met: 0 of 2
6. (op_4 obj_08 obj_26)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_26)
   goals met: 0 of 2
7. (op_5 obj_26 obj_02 obj_15)
   deleted: (pred_3 obj_15) (pred_12 obj_02 obj_26)
   added: (pred_3 obj_02) (pred_12 obj_15 obj_26)
   goals met: 0 of 2
8. (op_4 obj_26 obj_03)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_03)
   goals met: 0 of 2
9. (op_4 obj_03 obj_05)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_05)
   goals met: 0 of 2
10. (op_2 obj_05 obj_02)
   deleted: (pred_3 obj_02)
   added: (pred_9) (pred_12 obj_02 obj_05)
   goals met: 1 of 2
11. (op_4 obj_05 obj_03)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_03)
   goals met: 1 of 2
12. (op_4 obj_03 obj_26)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_26)
   goals met: 1 of 2
13. (op_3 obj_26 obj_15)
   deleted: (pred_12 obj_15 obj_26) (pred_9)
   added: (pred_3 obj_15)
   goals met: 1 of 2
14. (op_4 obj_26 obj_08)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_08)
   goals met: 1 of 2
15. (op_4 obj_08 obj_20)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_20)
   goals met: 1 of 2
16. (op_4 obj_20 obj_27)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_27)
   goals met: 1 of 2
17. (op_4 obj_27 obj_21)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_21)
   goals met: 1 of 2
18. (op_4 obj_21 obj_12)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_12)
   goals met: 1 of 2
19. (op_4 obj_12 obj_14)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_14)
   goals met: 1 of 2
20. (op_2 obj_14 obj_15)
   deleted: (pred_3 obj_15)
   added: (pred_9) (pred_12 obj_15 obj_14)
   goals met: 2 of 2
